NikolayBobovnikov/ircapture/auvir_embed/mocap/transmitter/stm32f103/Src/main.c
            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceTransmitState)
            {
                case STAGE_0:
                {
                    StartStopSequenceTransmitState = STAGE_ON1;
                    force_envelop_timer_output_on();
                    break;
                }
                case STAGE_ON1:
                {
                    StartStopSequenceTransmitState = STAGE_OFF1;
                    force_envelop_timer_output_off();
                    break;
                }
                case STAGE_OFF1:
                {
                    StartStopSequenceTransmitState = STAGE_ON2;
                    force_envelop_timer_output_on();
                    break;
                }

                // transitional state
                // TODO: check if possible to move to beginning of next state (thus remove delay)
                case STAGE_ON2:
                {
                    phtim_envelop->Instance->ARR = DelayBetweenDataFramesTotal;
                    StartStopSequenceTransmitState = STAGE_0;
                    TransmitterState = TX_DELAY;
                    break;
                }
            }
            break;
        }
        case TX_DELAY:
        {
            reset_transmitter();
            break;
        }
    } // switch(TransmitterState)
}
void reset_transmitter()
{
    TransmitterState = TX_WAITING;
    // TODO: add other steps if needed
    phtim_envelop->Instance->ARR = StartStopBitLength;
    StartStopSequenceTransmitState = STAGE_0;
    DataFrameState = DATAFRAME_0_NODATA;
}

void switch_to_data_transmission_state()
{
    TransmitterState = TX_DATA;
    DataFrameState = DATAFRAME_1_BEAMER_ID;
    StartStopSequenceTransmitState = STAGE_0;
    tx_current_bit_pos = 0;
    force_envelop_timer_output_off();
}

void p_w_modulate(uint8_t bit)
{
    if(bit == 1)
    {
        force_envelop_timer_output_on();
    }
    else // bit == 0
    {
        force_envelop_timer_output_off();
    }

}

void force_envelop_timer_output_on()
{
#ifdef DEBUG
    if(_is_direct_logic)
    {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_RESET);
    }
    else
    {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);
    }
#endif
    // Start pwm timer, depending on timer and channel number
    switch(currentOutputTimChannel)
    {
        case Timer2Channel1:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);
            }
            break;
        }
        case Timer2Channel2:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_2);
            }
            break;
        }
        case Timer2Channel3:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_3);
            }
            break;
        }
        case Timer2Channel4:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_4);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_4);
            }
            break;
        }
        case Timer3Channel1:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
            }
            break;
        }
        case Timer3Channel2:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_2);
            }
            break;
        }
        case Timer3Channel3:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_3);
            }
            break;
        }
        case Timer3Channel4:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_4);
            }
            break;
        }
        case Timer4Channel1:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1);
            }
            break;
        }
        case Timer4Channel2:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_2);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_2);
            }
            break;
        }
        case Timer4Channel3:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_3);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_3);
            }
            break;
        }
        case Timer4Channel4:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4);
            }
            else
            {
                HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4);
            }
            break;
        }
    }


}

void force_envelop_timer_output_off()
{
/*
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_2); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_3); // carrier
        HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_4); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_2); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_3); // carrier
        HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4); // carrier
        */
#ifdef DEBUG
    if(_is_direct_logic)
    {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_RESET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_SET);
    }
    else
    {
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_4, GPIO_PIN_SET);
        HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, GPIO_PIN_RESET);
    }
#endif

