NikolayBobovnikov/ircapture/auvir_embed/mocap/transmitter/stm32f103/Src/main.c
    // Stopt pwm timer, depending on timer and channel number
    switch(currentOutputTimChannel)
    {
        case Timer2Channel1:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_1);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_1);
            }
            break;
        }
        case Timer2Channel2:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_2);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_2);
            }
            break;
        }
        case Timer2Channel3:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_3);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_3);
            }
            break;
        }
        case Timer2Channel4:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim2, TIM_CHANNEL_4);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim2, TIM_CHANNEL_4);
            }
            break;
        }
        case Timer3Channel1:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_1);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_1);
            }
            break;
        }
        case Timer3Channel2:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_2);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_2);
            }
            break;
        }
        case Timer3Channel3:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_3);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_3);
            }
            break;
        }
        case Timer3Channel4:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim3, TIM_CHANNEL_4);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim3, TIM_CHANNEL_4);
            }
            break;
        }
        case Timer4Channel1:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_1);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_1);
            }
            break;
        }
        case Timer4Channel2:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_2);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_2);
            }
            break;
        }
        case Timer4Channel3:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_3);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_3);
            }
            break;
        }
        case Timer4Channel4:
        {
            if(_is_direct_logic)
            {
                HAL_TIM_PWM_Stop(&htim4, TIM_CHANNEL_4);
            }
            else
            {
                HAL_TIM_PWM_Start(&htim4, TIM_CHANNEL_4);
            }
            break;
        }
    }
}

void nop(){}
/* USER CODE END 4 */

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
    ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */

}

#endif

/**
  * @}
  */

/**
  * @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
